tutorials/9.1.2.1D_2phase_4componentGas_YCO2i_0_quaternaryNsCompositionalDarcyFoam_mutual_slbty_U_0.005_den_mu_Ns_2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  foam-extend 5.0
    \\  /    A nd           | PorousMedia: A Wikki Brasil project
     \\/     M anipulation  | Solver: coupledMatrixFoam
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         compositionalDarcyFoam;

startFrom           startTime;

startTime           0;

stopAt              endTime;

endTime             10; //20000;

deltaT              1;

writeControl        adjustableRunTime;

writeInterval       1; //5000;

purgeWrite          0;

writeFormat         ascii;

writePrecision      6;

writeCompression    off;

timeFormat          general;

timePrecision       6;

runTimeModifiable   yes;

adjustTimeStep      yes;

maxCo               1;

maxDeltaT           10;

functions
{}


// ************************************************************************* //
